<template>
    <div class="right-box">
        <div class="say-go">
            <div class="say-go__btn" title="点击评论" @click="scrollToSay">我有话要讲</div>
        </div>
        <div class="say-juzi right-box__bg">
            <div class="say-juzi__text">{{ sayText }}</div>
            <div class="say-juzi__btn" title="换一句" @click="changeSay">
                <svg
                    data-v-20be798c=""
                    t="1638082872111"
                    viewBox="0 0 1024 1024"
                    version="1.1"
                    xmlns="http://www.w3.org/2000/svg"
                    p-id="4648"
                    width="30"
                    height="30"
                >
                    <path
                        data-v-20be798c=""
                        d="M512.002 512.002m-491.986 0a491.986 491.986 0 1 0 983.972 0 491.986 491.986 0 1 0-983.972 0Z"
                        fill="#FDDF6D"
                        p-id="4649"
                    ></path>
                    <path
                        data-v-20be798c=""
                        d="M617.43 931.354c-271.716 0-491.984-220.268-491.984-491.984 0-145.168 62.886-275.632 162.888-365.684C129.058 155.124 20.018 320.826 20.018 511.998c0 271.716 220.268 491.984 491.984 491.984 126.548 0 241.924-47.794 329.096-126.298-67.104 34.312-143.126 53.67-223.668 53.67z"
                        fill="#FCC56B"
                        p-id="4650"
                    ></path>
                    <path
                        data-v-20be798c=""
                        d="M517.966 1003.908V464.212c-18.406-29.424-50.99-46.864-85.222-45.466-49.322 2.012-75.232 42.026-77.376 45.466v514.298M774.198 418.746c-49.322 2.012-75.232 42.026-77.376 45.466v503.838c61.322-24.876 116.502-61.736 162.596-107.71V464.212c-18.402-29.424-50.986-46.862-85.22-45.466z"
                        fill="#3FA9F5"
                        p-id="4651"
                    ></path>
                    <path
                        data-v-20be798c=""
                        d="M885.912 501.848a20.006 20.006 0 0 1-17.504-10.28c-18.174-32.624-52.634-52.886-89.928-52.886-36.346 0-71.204 20.476-90.966 53.44-5.682 9.478-17.978 12.556-27.458 6.874-9.482-5.684-12.558-17.976-6.874-27.458 26.956-44.958 74.966-72.888 125.3-72.888 51.806 0 99.662 28.14 124.896 73.44 5.38 9.656 1.914 21.846-7.744 27.222a19.926 19.926 0 0 1-9.722 2.536zM538.346 501.848a20 20 0 0 1-17.504-10.28c-18.17-32.624-52.63-52.886-89.928-52.886-36.346 0-71.204 20.476-90.966 53.44-5.684 9.478-17.978 12.556-27.458 6.874-9.482-5.684-12.558-17.976-6.874-27.458 26.956-44.958 74.966-72.888 125.3-72.888 51.806 0 99.664 28.14 124.896 73.44 5.38 9.656 1.91 21.846-7.744 27.222a19.92 19.92 0 0 1-9.722 2.536z"
                        fill="#7F184C"
                        p-id="4652"
                    ></path>
                    <path
                        data-v-20be798c=""
                        d="M607.404 742.544m-89.428 0a89.428 89.428 0 1 0 178.856 0 89.428 89.428 0 1 0-178.856 0Z"
                        fill="#7F184C"
                        p-id="4653"
                    ></path>
                    <path
                        data-v-20be798c=""
                        d="M660.06 498.998c9.478 5.678 21.774 2.604 27.458-6.874 19.762-32.966 54.618-53.44 90.966-53.44 37.296 0 71.754 20.266 89.928 52.886a20.004 20.004 0 0 0 27.226 7.748c9.658-5.38 13.124-17.568 7.744-27.222-25.234-45.3-73.09-73.44-124.896-73.44-50.332 0-98.346 27.93-125.3 72.888-5.686 9.478-2.608 21.77 6.874 27.454zM305.618 471.54c-5.684 9.482-2.608 21.774 6.874 27.458 9.482 5.678 21.774 2.604 27.458-6.874 19.762-32.966 54.618-53.44 90.966-53.44 37.296 0 71.756 20.266 89.928 52.886a20 20 0 0 0 27.226 7.748c9.656-5.38 13.124-17.568 7.744-27.222-25.234-45.3-73.09-73.44-124.896-73.44-50.336-0.002-98.346 27.928-125.3 72.884zM537.98 552.028c0-11.056-8.962-20.014-20.014-20.014-11.054 0-20.014 8.958-20.014 20.014v317.566c0 11.056 8.962 20.014 20.014 20.014 11.054 0 20.014-8.958 20.014-20.014v-42.512c18.902 15.548 43.084 24.896 69.414 24.896 26.328 0 50.512-9.348 69.414-24.896v4.88c0 11.056 8.962 20.014 20.014 20.014s20.014-8.958 20.014-20.014V552.028c0-11.056-8.962-20.014-20.014-20.014s-20.014 8.958-20.014 20.014v105.958c-18.902-15.548-43.084-24.896-69.414-24.896-26.328 0-50.512 9.348-69.414 24.896v-105.958z m69.414 121.092c38.276 0 69.414 31.14 69.414 69.416 0 38.276-31.138 69.414-69.414 69.414s-69.414-31.138-69.414-69.414c0-38.276 31.14-69.416 69.414-69.416z"
                        fill=""
                        p-id="4654"
                    ></path>
                    <path
                        data-v-20be798c=""
                        d="M875.582 872.116C967.276 779.546 1024 652.28 1024 512.002c0-206.234-122.744-391.41-312.698-471.754-10.186-4.302-21.926 0.46-26.232 10.634-4.304 10.18 0.456 21.926 10.638 26.23C870.82 151.18 983.972 321.884 983.972 512c0 111.928-39.188 214.862-104.532 295.854V552.03c0-11.056-8.962-20.014-20.014-20.014-11.054 0-20.014 8.958-20.014 20.014v299.574c-84.928 81.908-200.378 132.368-327.404 132.368-47.488 0-93.348-7.08-136.614-20.188V552.028c0-11.056-8.962-20.014-20.014-20.014-11.054 0-20.014 8.958-20.014 20.014v397.614C162.372 879.568 40.03 709.816 40.03 511.998 40.03 251.754 251.756 40.028 512 40.028c11.054 0 20.014-8.958 20.014-20.014S523.052 0 511.998 0C229.682 0 0 229.68 0 511.998c0 224.724 145.53 416.088 347.294 484.818a19.832 19.832 0 0 0 3.6 1.19c50.68 16.844 104.842 25.992 161.104 25.992 139.772 0 266.616-56.318 359.1-147.428a20.114 20.114 0 0 0 4.484-4.454z"
                        fill=""
                        p-id="4655"
                    ></path>
                    <path
                        data-v-20be798c=""
                        d="M696.83 898.71m-20.014 0a20.014 20.014 0 1 0 40.028 0 20.014 20.014 0 1 0-40.028 0Z"
                        fill=""
                        p-id="4656"
                    ></path>
                    <path
                        data-v-20be798c=""
                        d="M517.952 935.084m-20.014 0a20.014 20.014 0 1 0 40.028 0 20.014 20.014 0 1 0-40.028 0Z"
                        fill=""
                        p-id="4657"
                    ></path>
                    <path
                        data-v-20be798c=""
                        d="M631.182 35.768m-20.014 0a20.014 20.014 0 1 0 40.028 0 20.014 20.014 0 1 0-40.028 0Z"
                        fill=""
                        p-id="4658"
                    ></path>
                </svg>
            </div>
        </div>

        <div class="right-box__bg advertising">广告招租</div>
    </div>
</template>

<script>
export default {
    name: 'RightBox',

    data() {
        return {
            sayText: '',
            sayList: [
                '虽然我又穷又丑还没什么本事，但是我会哄女生睡觉呀。我一发微信给女生，她们就说：我要睡觉了，拜拜。',
                '努力了这么久，但凡有点儿天赋，也该有些成功的迹象了。',
                '人为什么叫人类，因为人活着就是累。',
                '岁月是把杀猪刀，是针对那些好看的人，它对长得丑的人一点办法都没有。',
                '我没见过一个煤矿工人靠挖煤又快又多当上了煤老板。',
                '就算大雨颠覆全城，公司照样算你迟到。',
                '有个姑娘问我借钱去整容，整的挺成功，我再没认出是谁问我借的钱。',
                '我尝试着做一个有趣的人，后来却跑偏了，成了一个逗逼。',
                '没有外表，谁TM看你内心啊',
                '没有好的五官，谁了解的三观',
                '爱情说白了就是在对的时间碰到有感觉的人，没有那么复杂。',
                '努力工作不一定能提前转正，但是划水一定会很轻松。',
                '和对象吵架，先不要追究吵架原因，要弄明白他胆子怎么肥了。',
                '虽然你长得丑，可是你想的美啊。',
                '我丑，是为了降低画质提高性能，为什么我的人生还那么卡呢？',
                '生活不是这样就是那样，总之，不会是你想的那样。',
                '你以为事实有回应 实际叫天天不应',
                '有钱能买来幸福吗？不能，有钱本身就是幸福！',
                '富人生活千姿百态，穷人大致相同',
                '特别能吃苦这五个字，我想了想，我只能做到前四个',
                '比三观更重要的是五官。',
                '这时代做什么事，门槛都变得好高。 想说当个宅男，还要先买得起房子。',
                '不回你消息，不是因为我高冷，而是因为我手冷。',
                '三分天注定，七分靠打拼。呵呵，还有90分看脸看脸看脸。',
                '三分天注定，七分靠打拼。呵呵，还有90分看脸看脸看脸。',
                '狗是人类最好的朋友。 然而狗最好的朋友是「屎」。',
                '如果你还在坚持，说明你还不够绝望。',
                '咸鱼翻了身，也还是咸鱼。',
                '两个人吵架，打他是解决不了问题的，但是解气啊。',
                '总是有人要输的，那为什么就不能是你呢？',
                '朋友说借二十块钱回头给你，借完钱之后我才知道，有些人一转身就是一辈子。',
                '我发现我挺能哄女孩睡觉的，只要我一发信息，女孩就说我要睡觉了。',
            ],
        };
    },

    mounted() {
        this.changeSay();
    },

    methods: {
        changeSay() {
            this.sayText = this.sayList[Math.floor(Math.random() * this.sayList.length)];
        },
        scrollToSay() {
            let el = document.getElementById('say');
            el?.scrollIntoView({ block: 'start', behavior: 'smooth' });
        },
    },
};
</script>

<style lang="scss" scoped>
.right-box {
    width: 20%;
    height: 100%;
    // 1536px

    // /* 屏幕大于 1440px 时应用该样式 */
    // @media screen and (min-width: 1440px) {
    //     width: 22%;
    // }

    /* 屏幕小于 1440px 时应用该样式 */
    @media screen and (max-width: 1536px) {
        width: 25%;
    }

    .right-box__bg {
        margin-top: 20px;
        background: #fff;
        border-radius: 6px;
        border: 1px solid rgba(0, 0, 0, 0.1);
        box-shadow: 0 10px 13px rgb(31 45 61/10%), 0 0 0 -1px rgb(32 160 255/20%),
            0 0 0 -25px rgb(32 160 255/30%);
        padding: 15px;
        user-select: none;
        box-sizing: border-box;
    }

    .advertising {
        line-height: 50px;
        color: #2b2d31;
        font-size: 1.4em;
        text-align: center;
    }

    .say-juzi {
        .say-juzi__btn {
            position: relative;
            text-align: center;

            svg {
                cursor: pointer;
                border: 2px solid #ebeef5;
                padding: 5px;
                border-radius: 50%;
            }
        }

        .say-juzi__text {
            border-bottom-left-radius: 15px 255px;
            border-bottom-right-radius: 225px 15px;
            border-top-left-radius: 255px 15px;
            border-top-right-radius: 15px 225px;
            border-style: solid;
            border-color: #ebeef5;
            padding: 15px;
            line-height: 1.8;
            background: #f2f6fc;
            color: #606266;
            margin-bottom: 15px;
        }
    }

    .say-go {
        margin-top: 0.5em;
        text-align: right;

        .say-go__btn {
            display: inline-block;
            cursor: pointer;
            background: #fff;
            border-radius: 100px;
            padding: 10px 35px;
            font-size: 15px;
            font-weight: 700;
            box-shadow: 0 10px 13px rgb(31 45 61/10%), 0 0 0 -1px rgb(32 160 255/20%),
                0 0 0 -25px rgb(32 160 255/30%);
            transition: all 0.25s, box-shadow 0s;
            letter-spacing: 1px;
            -webkit-user-select: none;
            -moz-user-select: none;
            -ms-user-select: none;
            user-select: none;
        }
    }
}
</style>
